Revit API Introduction Labs
Lab7_2_CreateDividedSurface Class
 Create a divided surface using reference of a face of the form.
 Namespace: Labs
 Assembly: labs (in labs.dll) Version: 3.0.0.1 (3.0.0.1)
Syntax
C#
public class Lab7_2_CreateDividedSurface : IExternalCommand
Visual Basic (Declaration)
Public Class Lab7_2_CreateDividedSurface _
	Implements IExternalCommand
Visual C++
public ref class Lab7_2_CreateDividedSurface : IExternalCommand
Inheritance Hierarchy
System.Object
 Labs.Lab7_2_CreateDividedSurface
See Also
Lab7_2_CreateDividedSurface Members
Labs Namespace